chenjiawei180/STM32-RE/USER/menu.h
 /******************************************************************************
  * @file       USER/menu.h
  * @author  cjw
  * @date     2016.1.28
  * @brief     This file contains the headers of the menu.
  ******************************************************************************/
#ifndef __MENU_H
#define __MENU_H

#include "stm32f10x.h"
#include "global.h"

typedef enum
{
    STANDBY_MENU = 0,
    ONE_MENU_F0,
    ONE_MENU_F1,
    ONE_MENU_F2,
    ONE_MENU_F3,
    ONE_MENU_F4,
    ONE_MENU_F5,
    ONE_MENU_F6,
    ONE_MENU_F7,
    ONE_MENU_F8,
    ONE_MENU_F9,
    ONE_MENU_FA,
    ONE_MENU_FB,
    ONE_MENU_FC,
    ONE_MENU_FD,
    ONE_MENU_FE,
}Menu_index;

struct Menu_def 
{
    Menu_index Index;               //本菜单索引号
    Menu_index Enter;               //按确认确时的索引
    Menu_index Up;                  //按UP键时的索引
    Menu_index Down;                //按DOWN键时的索引
    Menu_index Return;              //要执行的函数
    void (*handle)(void);    //本单的标题
};

extern const struct Menu_def MenuProc[];

static void Menu_Standby(void);
static void Menu_F0(void);
static void Menu_F1(void);
static void Menu_F2(void);
static void Menu_F3(void);
static void Menu_F4(void);
static void Menu_F5(void);
static void Menu_F6(void);
static void Menu_F7(void);
static void Menu_F8(void);
static void Menu_F9(void);
static void Menu_FA(void);
static void Menu_FB(void);
static void Menu_FC(void);
static void Menu_FD(void);
static void Menu_FE(void);


#endif /* __MENU_H */

